In [1]:
import pandas as pd
import numpy as np

![](figures/pandasanatomy.png)

In [5]:
population_dict = {'Califonia':38000000,
                 'Texas':26444423,
                 'New York': 19651127,
                 'Florida': 19552860,
                 'Illinois': 12882135}

In [23]:
population = pd.Series(population_dict)
population

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
Illinois     12882135
dtype: int64

In [8]:
population['Califonia']

38000000

In [9]:
population['Califonia':'Florida']

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
dtype: int64

In [10]:
S = pd.Series([2,4,6])
S

0    2
1    4
2    6
dtype: int64

In [13]:
S = pd.Series(5, index=[100,200,300])
S

100    5
200    5
300    5
dtype: int64

In [15]:
S[200]

5

In [17]:
S = pd.Series({2:'a', 1:'b', 3:'c', 3:'d'})
S

2    a
1    b
3    d
dtype: object

In [18]:
S[3]

'd'

In [19]:
area_dict = {'Califonia':429677,
                 'Texas':695627,
                 'New York': 141297,
                 'Florida': 170312,
                 'Illinois': 128821}

In [21]:
area = pd.Series(area_dict)
area

Califonia    429677
Texas        695627
New York     141297
Florida      170312
Illinois     128821
dtype: int64

In [25]:
population

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
Illinois     12882135
dtype: int64

In [36]:
states = pd.DataFrame({'population':population, 'area':area})

In [27]:
states

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [28]:
states.index

Index(['Califonia', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [29]:
states.columns

Index(['population', 'area'], dtype='object')

In [30]:
states['area']

Califonia    429677
Texas        695627
New York     141297
Florida      170312
Illinois     128821
Name: area, dtype: int64

In [32]:
states.loc['Califonia':'Florida']

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312

In [33]:
states.population

Califonia    38000000
Texas        26444423
New York     19651127
Florida      19552860
Illinois     12882135
Name: population, dtype: int64

In [37]:
states['area']

Califonia    429677
Texas        695627
New York     141297
Florida      170312
Illinois     128821
Name: area, dtype: int64

In [39]:
states.head(2)

           population    area
Califonia    38000000  429677
Texas        26444423  695627

In [40]:
states.tail(2)

          population    area
Florida     19552860  170312
Illinois    12882135  128821

In [55]:
states['density'] =states.population/states.area
states

           population    area     density
Califonia    38000000  429677   88.438525
Texas        26444423  695627   38.015234
New York     19651127  141297  139.076746
Florida      19552860  170312  114.806121
Illinois     12882135  128821  100.000272

In [52]:
states.drop('density', 1, inplace=True)

In [53]:
states

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [56]:
states

           population    area     density
Califonia    38000000  429677   88.438525
Texas        26444423  695627   38.015234
New York     19651127  141297  139.076746
Florida      19552860  170312  114.806121
Illinois     12882135  128821  100.000272

In [62]:
states[['population','area']]

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [67]:
states[0:1]

           population    area    density
Califonia    38000000  429677  88.438525

In [70]:
states.iloc[:100,:3]

           population    area     density
Califonia    38000000  429677   88.438525
Texas        26444423  695627   38.015234
New York     19651127  141297  139.076746
Florida      19552860  170312  114.806121
Illinois     12882135  128821  100.000272

In [73]:
states.loc[:'Illinois', :'area']

           population    area
Califonia    38000000  429677
Texas        26444423  695627
New York     19651127  141297
Florida      19552860  170312
Illinois     12882135  128821

In [74]:
states.loc[:'Illinois', ['population','density']]

           population     density
Califonia    38000000   88.438525
Texas        26444423   38.015234
New York     19651127  139.076746
Florida      19552860  114.806121
Illinois     12882135  100.000272

In [78]:
subset = states.loc[states.density>100]

In [79]:
subset.to_csv('states_subset.csv')